#### Aggregation and Grouping
Grouping and aggregation helps you summarize your data -- like answering:

*"What's the average salary per department?"*

*"How many users joined the Gym per month?"*

---

##### `.groupby()` function:
`df.groupby()` is used to group rows of a DataFrame based on the values in one or more columns, which allows you to then perform aggregate functions (like sum(), mean(), count(), etc.) on each group.

 Consider this DataFrame:

In [2]:
import pandas as pd

df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

This Says:
> "Group by Department, then calculate average Salary for each group".

---

##### Common Aggregation Functions

In [3]:
df.groupby("Team")["Salary"].mean()   #Average per team
df.groupby("Team")["Salary"].sum()    # Sum of salary per group
df.groupby("Team")["Salary"].count()  # How many entries
df.groupby("Team")["Salary"].min()
df.groupby("Team")["Salary"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary, dtype: int64

To group by multiple columns:

In [4]:
df.groupby(["Team", "Department"])["Salary"].mean()

Team  Department
A     HR            87.5
B     IT            81.5
C     Marketing     90.0
D     Sales         77.5
Name: Salary, dtype: float64

---

##### Custom Aggregations with `.agg()`
Apply multiple functions at once like this:

In [5]:
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In pandas, `.agg` and `.aggregate` are exactly the same -- they're aliases for the same method

Name your own functions:

In [6]:
df.groupby("Team")["Salary"].agg(
    avg_score = "mean",
    high_score = "max",
    least_score = "min"
)

      avg_score  high_score  least_score
Team
A          87.5          90           85
B          81.5          85           78
C          90.0          92           88
D          77.5          80           75

Apply different functions to different columns:

In [7]:
df.groupby("Team").agg({
    "Salary":"mean",
    "Age":"max"
})

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

---

##### `.transform()` : Adds new column based on group. Same shape as original

In [9]:
df["Team_avg"] = df.groupby("Team")["Salary"].transform("mean")
df

  Department Team Gender  Salary  Age   JoinDate  Team_avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

---

##### `.filter()` : Keeps or discards whole groups through conditioning.

In [11]:
df.groupby("Team").filter(lambda x: x["Salary"].mean()  > 85)

  Department Team Gender  Salary  Age   JoinDate  Team_avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0